In [3]:
import pandas as pd
import os
import dotenv
dotenv.load_dotenv(override=True)
filepath = "/Users/danielamuto/Documents/EPICODE/PYTHON EPICODE/beginner_datasets/insurance.csv"
insurance = pd.read_csv(filepath)

In [35]:
insurance.shape

(1338, 7)

In [37]:
insurance

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [39]:
list(insurance.columns)

['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges']

In [41]:
regioni = insurance.groupby('region')
print(regioni['charges'].mean())

region
northeast    13406.384516
northwest    12417.575374
southeast    14735.411438
southwest    12346.937377
Name: charges, dtype: float64

In [43]:
fumatori = insurance.groupby('smoker')
sex = insurance.groupby('sex')
print(fumatori['charges'].mean(), '\n')
print(sex['charges'].mean())

smoker
no      8434.268298
yes    32050.231832
Name: charges, dtype: float64

sex
female    12569.578844
male      13956.751178
Name: charges, dtype: float64

In [47]:
insurance['bmi'].describe()

count    1338.000000
mean       30.663397
std         6.098187
min        15.960000
25%        26.296250
50%        30.400000
75%        34.693750
max        53.130000
Name: bmi, dtype: float64

In [49]:
bmi_quartili = list(insurance['bmi'].describe())[-4:-1]

q1 = insurance['bmi'] < bmi_quartili[0]
q2 = (insurance['bmi'] >= bmi_quartili[0]) & (insurance['bmi'] < bmi_quartili[1])
q3 = (insurance['bmi'] >= bmi_quartili[1]) & (insurance['bmi'] < bmi_quartili[2])
q4 = insurance['bmi'] >= bmi_quartili[2]

insurance.loc[q1, "BMI's quartile"] = "Q1: Under 26.3"
insurance.loc[q2, "BMI's quartile"] = "Q2: 26.3 - 30.4"
insurance.loc[q3, "BMI's quartile"] = "Q3: 30.4 - 34.7"
insurance.loc[q4, "BMI's quartile"] = "Q4: Over 34.7"

quartile = insurance.groupby("BMI's quartile")
quartile['charges'].agg(["min", "mean", "max"])

                       min          mean          max
BMI's quartile
Q1: Under 26.3   1121.8739  10360.662825  38245.59327
Q2: 26.3 - 30.4  1131.5066  11398.362224  62592.87309
Q3: 30.4 - 34.7  1135.9407  14323.550842  60021.39897
Q4: Over 34.7    1141.4451  16987.936691  63770.42801

In [53]:
iris = pd.read_csv("/Users/danielamuto/Documents/EPICODE/PYTHON EPICODE/beginner_datasets/iris.csv")

In [55]:
iris

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [59]:
iris['petal_length'].mean().round(2)

3.76

In [67]:
iris.groupby('species')['petal_length'].mean().round(2)

species
Iris-setosa        1.46
Iris-versicolor    4.26
Iris-virginica     5.55
Name: petal_length, dtype: float64

In [75]:
iris.groupby('species')['sepal_width'].agg(['min', 'mean', 'max']).round(2)

                 min  mean  max
species
Iris-setosa      2.3  3.42  4.4
Iris-versicolor  2.0  2.77  3.4
Iris-virginica   2.2  2.97  3.8

In [77]:
wine = pd.read_csv("/Users/danielamuto/Documents/EPICODE/PYTHON EPICODE/beginner_datasets/wine.csv")

In [79]:
wine

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality,type
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5,red
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.99680,3.20,0.68,9.8,5,red
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.99700,3.26,0.65,9.8,5,red
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.99800,3.16,0.58,9.8,6,red
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.99780,3.51,0.56,9.4,5,red
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6492,6.2,0.21,0.29,1.6,0.039,24.0,92.0,0.99114,3.27,0.50,11.2,6,white
6493,6.6,0.32,0.36,8.0,0.047,57.0,168.0,0.99490,3.15,0.46,9.6,5,white
6494,6.5,0.24,0.19,1.2,0.041,30.0,111.0,0.99254,2.99,0.46,9.4,6,white
6495,5.5,0.29,0.30,1.1,0.022,20.0,110.0,0.98869,3.34,0.38,12.8,7,white
6496,6.0,0.21,0.38,0.8,0.020,22.0,98.0,0.98941,3.26,0.32,11.8,6,white

In [81]:
media_alcohol_quality = wine.groupby('quality')['alcohol'].mean().round(2)
media_alcohol_quality

quality
3    10.22
4    10.18
5     9.84
6    10.59
7    11.39
8    11.68
9    12.18
Name: alcohol, dtype: float64

In [83]:
tot_media_alcohol = wine['alcohol'].mean().round(2)
tot_media_alcohol

10.49

In [85]:
bianchi_rossi = wine.groupby('type')['alcohol'].mean().round(2)
bianchi_rossi

type
red      10.42
white    10.51
Name: alcohol, dtype: float64

In [87]:
media_quality_ph = wine.groupby('quality')['pH'].mean().round(2)
media_quality_ph

quality
3    3.26
4    3.23
5    3.21
6    3.22
7    3.23
8    3.22
9    3.31
Name: pH, dtype: float64

In [93]:
bianchi_rossi_ph = wine.groupby('type')['pH'].mean().round(2)
bianchi_rossi_ph

type
red      3.31
white    3.19
Name: pH, dtype: float64

In [97]:
tot_media_ph = wine['pH'].mean().round(2)
tot_media_ph

3.22

In [95]:
media_quality_sulphates = wine.groupby('quality')['sulphates'].mean().round(2)
media_quality_sulphates

quality
3    0.51
4    0.51
5    0.53
6    0.53
7    0.55
8    0.51
9    0.47
Name: sulphates, dtype: float64

In [99]:
tot_media_sulphates = wine['sulphates'].mean().round(2)
tot_media_sulphates

0.53

In [101]:
bianchi_rossi_sulph = wine.groupby('type')['sulphates'].mean().round(2)
bianchi_rossi_sulph

type
red      0.66
white    0.49
Name: sulphates, dtype: float64

In [5]:
boston = pd.read_csv("/Users/danielamuto/Documents/EPICODE/PYTHON EPICODE/beginner_datasets/boston.csv")

In [7]:
boston

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273,21.0,396.90,7.88,11.9

In [15]:
boston[['crim', 'medv']].describe()

             crim        medv
count  506.000000  506.000000
mean     3.613524   22.532806
std      8.601545    9.197104
min      0.006320    5.000000
25%      0.082045   17.025000
50%      0.256510   21.200000
75%      3.677083   25.000000
max     88.976200   50.000000

In [23]:
boston.groupby('chas')['medv'].mean().round(2)

chas
0    22.09
1    28.44
Name: medv, dtype: float64

In [25]:
boston.groupby('ptratio')['rm'].mean().round(2)

ptratio
12.6    7.22
13.0    7.41
13.6    7.92
14.4    7.88
14.7    6.25
14.8    6.75
14.9    7.31
15.1    6.82
15.2    6.42
15.3    6.71
15.5    7.24
15.6    6.70
15.9    7.00
16.0    6.23
16.1    6.43
16.4    6.14
16.6    6.34
16.8    6.15
16.9    6.02
17.0    6.87
17.3    6.38
17.4    7.21
17.6    6.82
17.8    6.50
17.9    6.13
18.0    7.22
18.2    6.28
18.3    6.52
18.4    6.29
18.5    6.29
18.6    6.11
18.7    6.41
18.8    5.96
18.9    5.79
19.0    6.45
19.1    6.23
19.2    6.05
19.6    6.22
19.7    6.30
20.1    5.59
20.2    6.02
20.9    6.27
21.0    6.04
21.1    5.89
21.2    6.03
22.0    5.80
Name: rm, dtype: float64

In [29]:
boston.groupby('rm')['medv'].mean().round(2)

rm
3.561    27.50
3.863    23.10
4.138    12.85
4.368     8.80
4.519     7.00
         ...
8.375    50.00
8.398    48.80
8.704    50.00
8.725    50.00
8.780    21.90
Name: medv, Length: 446, dtype: float64

In [31]:
boston.groupby('rad')['age'].mean().round(2)

rad
1     45.02
2     64.77
3     49.31
4     60.84
5     69.22
6     60.14
7     40.14
8     67.35
24    89.81
Name: age, dtype: float64

In [33]:
boston.groupby('rad')['rm'].mean().round(2)

rad
1     6.56
2     6.65
3     6.47
4     6.13
5     6.39
6     6.10
7     6.65
8     6.95
24    6.02
Name: rm, dtype: float64

In [35]:
boston.groupby('rad')['tax'].mean().round(2)

rad
1     291.45
2     260.67
3     246.08
4     335.98
5     331.84
6     372.88
7     304.41
8     301.25
24    666.00
Name: tax, dtype: float64

In [37]:
employees_df = pd.DataFrame({ 'employee_id': [101, 102, 103, 104, 105], 'name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'], 'department_id': [1, 2, 1, 2, 3] })

In [39]:
employees_df

   employee_id     name  department_id
0          101    Alice              1
1          102      Bob              2
2          103  Charlie              1
3          104    David              2
4          105     Emma              3

In [41]:
departments_df = pd.DataFrame({ 'department_id': [1, 2, 3], 'department_name': ['HR', 'IT', 'Finance'], 'location': ['New York', 'San Francisco', 'Chicago'] })

In [43]:
departments_df

   department_id department_name       location
0              1              HR       New York
1              2              IT  San Francisco
2              3         Finance        Chicago

In [51]:
pd.merge(left=employees_df, right=departments_df, on="department_id")

   employee_id     name  department_id department_name       location
0          101    Alice              1              HR       New York
1          102      Bob              2              IT  San Francisco
2          103  Charlie              1              HR       New York
3          104    David              2              IT  San Francisco
4          105     Emma              3         Finance        Chicago

In [55]:
employees_df = employees_df.set_index("department_id")
departments_df = departments_df.set_index("department_id")
employees_df.join(departments_df)

               employee_id     name department_name       location
department_id
1                      101    Alice              HR       New York
2                      102      Bob              IT  San Francisco
1                      103  Charlie              HR       New York
2                      104    David              IT  San Francisco
3                      105     Emma         Finance        Chicago